app/controllers/games_controller.rb

SELECT  "tentatives".* FROM "tentatives" WHERE "tentatives"."user_id" = ? AND "tentatives"."game_id" = ? AND "tentatives"."chapter" = ? AND "tentatives"."level" = ? AND "tentatives"."success" = ?  ORDER BY "tentatives"."score" DESC LIMIT 1  [["user_id", 3], ["game_id", 1], ["chapter", 1], ["level", 1], ["success", "t"]]
---
  def show
    @tentatives = Array.new(5) { Array.new(20) }
    for c in 0..4
      for l in 0..19
        tentative = Tentative.where( user_id: current_user.id, game_id: @game.id, chapter: c+1, level: l+1, success: true).order(score: :desc).first