app/controllers/tentatives_controller.rb

  def create
    @tentative = Tentative.new(tentative_params)
    @tentative.user_id = current_user.id
    @tentative.game_id = 1

    respond_to do |format|
      if @tentative.save
---
INSERT INTO "tentatives" ("chapter", "level", "success", "shots", "beurk", "score", "user_id", "game_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)